import { z } from "zod";

export const dishSchema = z.object({
  name: z
    .string({ message: "שם המנה הוא חובה" })
    .min(2, "שם המנה חייב להכיל לפחות 2 תווים")
    .max(50, "שם המנה יכול להכיל עד 50 תווים")
    .regex(
      /^[A-Za-z\u0590-\u05FF ]+$/,
      "שם המנה  יכול להכיל רק אותיות באנגלית או בעברית ורווחים",
    ),
  price: z
    .number({ message: "מחיר המנה הוא חובה" })
    .max(500, "מחיר המנה לא יכול להיות מעל 500")
    .min(0, "מחיר המנה לא יכול להיות שלילי"),
  description: z
    .string({ message: "תיאור המנה הוא חובה" })
    .min(2, "תיאור המנה חייב להכיל לפחות 2 תווים")
    .max(500, "תיאור המנה יכול להכיל עד 500 תווים")
    .regex(
      /^[A-Za-z\u0590-\u05FF ]+$/,
      "תיאור המנה  יכול להכיל רק אותיות באנגלית או בעברית ורווחים",
    ),
});
export type DishDTO = z.infer<typeof dishSchema>;
